Tekla.Structures.Dialog.Data.AppliedAttributesSelector
The Tekla.Structures.Dialog.Data.AppliedAttributesSelector class selects the current applied attributes for any Tekla.Structures.Model.Part instance.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.SelectAppliedAttributes(Tekla.Structures.Model.Part,Tekla.Structures.Dialog.Data.MaterialType)
Selects the current applied attributes to the given Tekla.Structures.Model.Part instance.
Throws System.ArgumentNullException: Thrown when part is null.
Throws System.ApplicationException: Thrown when the applied attributes cannot be selected for part.
part: The Tekla.Structures.Model.Part to set the current applied values to.
materialType: The type of material of part.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.SelectAppliedAttributes(Tekla.Structures.Model.Part,Tekla.Structures.Dialog.Data.MaterialType,Tekla.Structures.Dialog.Data.IAppliedAttributesSelector)
Selects the current applied attributes to the given Tekla.Structures.Model.Part instance.
part: The Tekla.Structures.Model.Part to set the current applied values to.
materialType: The type of material of part.
appliedAttributesSelector: An instance of an Tekla.Structures.Dialog.Data.IAppliedAttributesSelector interface.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.SelectDefaultEndPoints(Tekla.Structures.Model.Beam,Tekla.Structures.Dialog.Data.MaterialType,Tekla.Common.Geometry.Vector3)
Selects the default end points to column for the given referencePosition.
The Tekla.Structures.Model.Beam.Type property of column must be set to either Tekla.Structures.Model.Beam.BeamTypeEnum.COLUMN or Tekla.Structures.Model.Beam.BeamTypeEnum.PAD_FOOTING.
Throws System.ArgumentException:
Thrown when column is neither of type Tekla.Structures.Model.Beam.BeamTypeEnum.COLUMN or Tekla.Structures.Model.Beam.BeamTypeEnum.PAD_FOOTING.
Throws System.ArgumentNullException:
Thrown when column is null.
Throws System.ApplicationException:
Thrown when the applied attributes cannot be selected for column.
column: The Tekla.Structures.Model.Beam to set the default Tekla.Structures.Model.Beam.StartPoint and Tekla.Structures.Model.Beam.EndPoint values on.
materialType: The type of material of column.
referencePosition: The reference location to position column against.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.SelectDefaultEndPoints(Tekla.Structures.Model.Beam,Tekla.Structures.Dialog.Data.MaterialType,Tekla.Common.Geometry.Vector3,Tekla.Structures.Dialog.Data.IAppliedAttributesSelector)
Selects the default end points to column for the given referencePosition.
The Tekla.Structures.Model.Beam.Type property of column must be set to either Tekla.Structures.Model.Beam.BeamTypeEnum.COLUMN or Tekla.Structures.Model.Beam.BeamTypeEnum.PAD_FOOTING.
column: The Tekla.Structures.Model.Beam to set the default Tekla.Structures.Model.Beam.StartPoint and Tekla.Structures.Model.Beam.EndPoint values on.
materialType: The type of material of column.
referencePosition: The reference location to position column against.
appliedAttributesSelector: An instance of an Tekla.Structures.Dialog.Data.IAppliedAttributesSelector interface.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.SelectAppliedAttributes(Tekla.Structures.Model.SingleRebar)
[Proto] Selects the current applied attributes to the given Tekla.Structures.Model.SingleRebar instance.
Throws System.ArgumentNullException: Thrown when singleRebar is null.
Throws System.ApplicationException: Thrown when the applied attributes cannot be selected for singleRebar.
singleRebar: The Tekla.Structures.Model.SingleRebar to set the current applied values to.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.Construct(Tekla.Structures.Model.Part,System.Collections.Generic.IEnumerable{Tekla.Common.Geometry.Vector3})
[Proto] Prototype function for constructing a Tekla.Structures.Model.RebarMesh by applied values.
fatherPart: The father of the mesh (not required?)
inputPoints: The input points for construction.
Returns: A newly constructed Tekla.Structures.Model.RebarMesh, ready to be inserted to TS.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.AssertNotNull(Tekla.Structures.Model.ModelObject)
Asserts that the given Tekla.Structures.Model.ModelObject is not null.
modelObject: The Tekla.Structures.Model.ModelObject to assert.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.FromStruct``2(``0,``1@)
Copies the data from the given source to the given target.
The type of the target object, must have a FromStruct(ref TValue) method.
The type of the source value.
target: The target object.
source: The source value.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.ToStruct``2(``0,``1@)
Copies the data from the given source to the given target.
The type of the source object, must have a ToStruct(ref TValue) method.
The type of the target value.
source: The source object.
target: The target value.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.SelectAppliedAttributes``1(Tekla.Structures.Model.ModelObject,Tekla.BIM.FuncByRef{``0,System.Int32})
Selects the current applied values for the given modelObject.
The type of the struct through which the applied values need to be selected.
modelObject: The target Tekla.Structures.Model.ModelObject instance to set the applied values to.
dotSelectAppliedAttributes: The method selecting the applied values to any  instance.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.DotExportSelectPartAppliedAttributes(Tekla.Structures.ModelInternal.dotPart_t@,Tekla.Structures.Dialog.Data.Native.dotMaterialType)
Selects the current applied values to part.
It's expected that the target type to get the applied values for,
is indicated by Tekla.Structures.ModelInternal.dotModelObject_t.Type and Tekla.Structures.ModelInternal.dotPart_t.SubType.
part: The Tekla.Structures.ModelInternal.dotPart_t instance to set the current applied values to.
dotMaterialType: The type of material of the part to select the applied values for.
Returns: Greater than zero on succes; otherwise, zero.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.DotExportSelectColumnAppliedLevels(Tekla.Structures.Model.Beam.BeamTypeEnum,Tekla.Structures.Dialog.Data.Native.dotMaterialType,System.Double@,System.Double@)
Selects the current default bottom and top levels for a Tekla.Structures.Model.Beam with the given Tekla.Structures.Model.Beam.BeamTypeEnum.
beamType: The type of beam to get the current applied levels for.
dotMaterialType: The type of material of the beam to get the current applied levels for.
bottomLevel: The offset to apply on Tekla.Structures.Model.Beam.StartPoint against a specific reference location.
topLevel: The offset to apply on Tekla.Structures.Model.Beam.EndPoint against a specific reference location.
Returns: Greater than zero on succes; otherwise, zero.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.DotExportCreateRebarMeshFromInputValues(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.Internal.dotPoint_t[],System.Int32,Tekla.Structures.ModelInternal.dotRebarMesh_t@)
Creates a Tekla.Structures.ModelInternal.dotRebarMesh_t from the given input values.
fatherIdentifier: The identifier of the father part.
inputPoints: The sequence of input points.
amountOfInputPoints: The count of input points.
dotRebarMesh: The constructed rebar mesh.
Returns: Greater than zero on succes; otherwise, zero.

Tekla.Structures.Dialog.Data.AppliedAttributesSelector.DotExportSelectSingleRebarApliedAttributes(Tekla.Structures.ModelInternal.dotSingleRebar_t@)
Selects the current applied values to singleRebar.
singleRebar: The Tekla.Structures.ModelInternal.dotSingleRebar_t instance to set the current applied values to.
Returns: Greater than zero on succes; otherwise, zero.